chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
static const char *const CTL_NAME[CTL_COUNT] = {
    "上一張", "繼續", "下一張", "方向", "返回"
};
static const int CTL_ACT[CTL_COUNT] = {
    PAUSE_PREV, PAUSE_RESUME, PAUSE_NEXT, PAUSE_ROTATE, PAUSE_MENU
};

/* 版面跟著方向走：直立畫布是 480x800、橫向是 800x480，寫死座標會跑掉。 */
static int ctl_y(void)     { return gfx_height() - CTL_H - 12; }
static int ctl_btn_w(void)
{
    return (gfx_width() - 2 * CTL_X0 - (CTL_COUNT - 1) * CTL_GAP) / CTL_COUNT;
}
static int ctl_btn_x(int i) { return CTL_X0 + i * (ctl_btn_w() + CTL_GAP); }

static void ctl_backup(bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    uint16_t *sv    = CTL_SAVE;
    int       w     = gfx_width();
    int       y0    = ctl_y();

    if (gfx_is_landscape()) {
        /* 橫向：畫布與面板同向，一列就是一段連續記憶體。 */
        for (int j = 0; j < CTL_H; j++) {
            uint16_t *fb = front + (uint32_t)(y0 + j) * PHYS_W;

            if (restore) { memcpy(fb, sv, (size_t)w * 2u); }
            else         { memcpy(sv, fb, (size_t)w * 2u); }
            sv += w;
        }
    } else {
        /* 直立：邏輯 x 是實體列，所以沿著邏輯 y 走才連續。 */
        for (int i = 0; i < w; i++) {
            uint16_t *fb = front + (uint32_t)(w - 1 - i) * PHYS_W + (uint32_t)y0;

            if (restore) { memcpy(fb, sv, (size_t)CTL_H * 2u); }
            else         { memcpy(sv, fb, (size_t)CTL_H * 2u); }
            sv += CTL_H;
        }
    }
}

static void ctl_draw(void)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int       y0    = ctl_y();
    int       bw    = ctl_btn_w();

    gfx_set_framebuffer(front);
    gfx_fill_rect(0, y0, gfx_width(), CTL_H, COL_BG);
    for (int i = 0; i < CTL_COUNT; i++) {
        int bx = ctl_btn_x(i);

        gfx_pill(bx, y0 + 12, bw, CTL_BTN_H, COL_PANEL);
        gfx_text_center(bx + bw / 2, y0 + 12 + (CTL_BTN_H - 24) / 2,
                        CTL_NAME[i], COL_TEXT);
    }
    gfx_set_framebuffer(back);
}

/* 點在控制列上就回傳對應的動作，否則回 -1（交給滑動判定）。 */
static int ctl_hit(int x, int y)
{
    if (y < ctl_y()) {
        return -1;
    }
    for (int i = 0; i < CTL_COUNT; i++) {
        int bx = ctl_btn_x(i);

        if (x >= bx && x < bx + ctl_btn_w()) {
            return CTL_ACT[i];
        }
    }
    return PAUSE_RESUME - 1000;         /* 點在列上但沒中按鈕：什麼都不做 */
}

static int paused_loop_inner(void);

/* 進暫停就畫控制列，離開時還原底下的畫面。所有出口都會經過這裡，
 * 不會有「某條路徑忘了還原」的問題（board-notes 14.5 那個對稱性教訓）。 */
static int paused_loop(void)
{
    int a;

    ctl_backup(false);
    ctl_draw();
    a = paused_loop_inner();
    ctl_backup(true);
    return a;
}

static int paused_loop_inner(void)
{
    g_paused    = 1u;
    g_req_pause = 0u;               /* 消化掉進來的那一次 */
    flash_icon(true);

    for (;;) {
        int x0, y0;

        watchdog_feed();
        if (!sd_present()) {
            g_req_pause = 0u;
            g_paused    = 0u;
            return PAUSE_MENU;
        }
        if (g_req_pause) {
            g_req_pause = 0u;
            g_paused    = 0u;
            flash_icon(false);
            return PAUSE_RESUME;
        }

        /* 暫停中只吃控制列上的按鈕。

         * 原本這裡是全螢幕的滑動手勢（左右翻頁、下滑回選單、上滑切方向）。
         * 手勢好用但**看不見** —— 第一次拿到相框的人不會知道有這回事，
         * 而且斜著滑還要處理兩種動作互搶、快速滑動還會漏報座標
         * （board-notes 14.7）。控制列把同一組動作攤在畫面上之後，
         * 手勢就只剩「多一條容易誤觸的路徑」，所以整個拿掉。 */
        if (read_touch(&x0, &y0)) {
            int hit = ctl_hit(x0, y0);

            g_dbg_touch_hit++;
            wait_release();
            if (hit >= 0) {
                /* 切方向要留在暫停，讓使用者當場看到結果。 */
                if (hit != PAUSE_ROTATE) {
                    g_paused = 0u;
                }
                return hit;
            }
            /* 控制列以外、或列上的空白處：什麼都不做。 */
        }
        nap(30);
    }
}


/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉，
 *     3 = 暫停中按了上一張，4 = 下一張。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            /* 亮度 0（螢幕關著）：不累計時間，再點亮時這張還有完整時間。 */
            nap(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        if (g_req_pause) {
            return 3;               /* 交給 slideshow 統一處理暫停 */
        }

        /* 播放中點一下畫面就暫停並叫出控制列。
         *
         * 原本只有實體鍵能暫停，而滑動手勢只在暫停中才有作用 —— 等於
         * 「要先知道有那顆按鍵，才進得去操作介面」。點畫面是最直覺的入口，
         * 而且跟影片播放器的操作方式一致。 */
        {
            int tx, ty;

            if (read_touch(&tx, &ty)) {
                (void)tx; (void)ty;
                wait_release();
                return 3;
            }
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    for (;;) {
        int a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            return 0;
        }
        if (a == PAUSE_ROTATE) {
            photo_set_orientation((photo_orient_t)
                (((uint32_t)photo_get_orientation() + 1u) % PHOTO_ORIENT_COUNT));
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            g_decode_fail++;
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            g_decode_ok++;
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    wait_release();

